@kavya498 I had an interesting discovery today; if I do an exactly once invocation **per run** (one DAG is built, exactly one `root_key` is created/updated) I can see a 100% consistency with the IBM Cloud objects.

<details>

<summary><code>root_key</code> found all the times</summary>

```bash
❯ terragrunt plan -compact-warnings -target module.kms_cos_logdna
module.kms_cos_logdna.random_password.random_byok: Refreshing state... [id=none]
module.ibm-resource-group.ibm_resource_group.ibm_rg: Refreshing state... [id=ID1]
module.kms_cos_logdna.ibm_resource_instance.kms_instance: Refreshing state... [id=crn:v1:bluemix:public:kms:ca-tor:a/ID2:ID3::]
module.kms_cos_logdna.ibm_iam_authorization_policy.cos_access_kms[0]: Refreshing state... [id=ID5]
module.kms_cos_logdna.ibm_kms_key.root_key: Refreshing state... [id=crn:v1:bluemix:public:kms:ca-tor:a/ID2:ID3:key:ID4]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

Warnings:

- Value for undeclared variable
- Value for undeclared variable
- Values for undeclared variables
- Resource targeting is in effect

To see the full warning notes, run Terraform without -compact-warnings.
❯ terragrunt plan -compact-warnings -target module.kms_cos_logdna
module.kms_cos_logdna.random_password.random_byok: Refreshing state... [id=none]
module.ibm-resource-group.ibm_resource_group.ibm_rg: Refreshing state... [id=ID1]
module.kms_cos_logdna.ibm_resource_instance.kms_instance: Refreshing state... [id=crn:v1:bluemix:public:kms:ca-tor:a/ID2:ID3::]
module.kms_cos_logdna.ibm_iam_authorization_policy.cos_access_kms[0]: Refreshing state... [id=ID5]
module.kms_cos_logdna.ibm_kms_key.root_key: Refreshing state... [id=crn:v1:bluemix:public:kms:ca-tor:a/ID2:ID3:key:ID4]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

Warnings:

- Value for undeclared variable
- Value for undeclared variable
- Values for undeclared variables
- Resource targeting is in effect

To see the full warning notes, run Terraform without -compact-warnings.
```

</details>

Anyway, if in another run I call the same module more than once - having multiple `root_key`s  provisioned, in a different and unrelated KMS instance, I get random 404s and prompts for key re-creations:

<details>
<summary><code>root_key</code> 404 and failures</summary>

```bash
❯ terragrunt plan -compact-warnings -target module.kms_cos_logdna -target module.kms_cos_backups
module.kms_cos_logdna.random_password.random_byok: Refreshing state... [id=none]
module.kms_cos_backups.random_password.random_byok: Refreshing state... [id=none]
module.ibm-resource-group.ibm_resource_group.ibm_rg: Refreshing state... [id=ID1]
module.kms_cos_logdna.ibm_resource_instance.kms_instance: Refreshing state... [id=crn:v1:bluemix:public:kms:ca-tor:a/ID2:ID3::]
module.kms_cos_backups.ibm_resource_instance.kms_instance: Refreshing state... [id=crn:v1:bluemix:public:kms:ca-tor:a/ID2:ID4::]
module.kms_cos_backups.ibm_kms_key.root_key: Refreshing state... [id=crn:v1:bluemix:public:kms:ca-tor:a/ID2:ID4:key:ID5]
module.kms_cos_backups.ibm_iam_authorization_policy.cos_access_kms[0]: Refreshing state... [id=ID6]
module.kms_cos_logdna.ibm_kms_key.root_key: Refreshing state... [id=crn:v1:bluemix:public:kms:ca-tor:a/ID2:ID3:key:ID7]
module.kms_cos_logdna.ibm_iam_authorization_policy.cos_access_kms[0]: Refreshing state... [id=ID8]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.kms_cos_logdna.ibm_kms_key.root_key has been deleted
  - resource "ibm_kms_key" "root_key" {
      - crn                     = "crn:v1:bluemix:public:kms:ca-tor:a/ID2:ID3:key:ID7" -> null
      - endpoint_type           = "public" -> null
      - force_delete            = false -> null
      - id                      = "crn:v1:bluemix:public:kms:ca-tor:a/ID2:ID3:key:ID7" -> null
      - instance_crn            = "crn:v1:bluemix:public:kms:ca-tor:a/ID2:ID3::" -> null
      - instance_id             = "ID3" -> null
      - key_id                  = "ID7" -> null
      - key_name                = "root_key" -> null
      - key_ring_id             = "default" -> null
      - resource_controller_url = "https://cloud.ibm.com/services/kms/crn%3Av1%3Abluemix%3Apublic%3Akms%3Aca-tor%3Aa%2FID2%3AID3%3A%3A" -> null
      - resource_crn            = "crn:v1:bluemix:public:kms:ca-tor:a/ID2:ID3:key:ID7" -> null
      - resource_name           = "root_key" -> null
      - resource_status         = "1" -> null
      - standard_key            = false -> null
      - type                    = "kms" -> null

      - timeouts {}
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.kms_cos_logdna.ibm_kms_key.root_key will be created
  + resource "ibm_kms_key" "root_key" {
      + crn                     = (known after apply)
      + endpoint_type           = (known after apply)
      + force_delete            = false
      + id                      = (known after apply)
      + instance_crn            = (known after apply)
      + instance_id             = "ID3"
      + key_id                  = (known after apply)
      + key_name                = "root_key"
      + key_ring_id             = "default"
      + payload                 = (sensitive)
      + resource_controller_url = (known after apply)
      + resource_crn            = (known after apply)
      + resource_group_name     = (known after apply)
      + resource_name           = (known after apply)
      + resource_status         = (known after apply)
      + standard_key            = false
      + type                    = (known after apply)

      + policies {
          + dual_auth_delete {
              + created_by       = (known after apply)
              + creation_date    = (known after apply)
              + crn              = (known after apply)
              + enabled          = (known after apply)
              + id               = (known after apply)
              + last_update_date = (known after apply)
              + updated_by       = (known after apply)
            }

          + rotation {
              + created_by       = (known after apply)
              + creation_date    = (known after apply)
              + crn              = (known after apply)
              + id               = (known after apply)
              + interval_month   = (known after apply)
              + last_update_date = (known after apply)
              + updated_by       = (known after apply)
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Warnings:

- Value for undeclared variable
- Value for undeclared variable
- Values for undeclared variables
- Resource targeting is in effect

To see the full warning notes, run Terraform without -compact-warnings.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
❯ terragrunt plan -compact-warnings -target module.kms_cos_logdna -target module.kms_cos_backups
module.kms_cos_logdna.random_password.random_byok: Refreshing state... [id=none]
module.kms_cos_backups.random_password.random_byok: Refreshing state... [id=none]
module.ibm-resource-group.ibm_resource_group.ibm_rg: Refreshing state... [id=ID1]
module.kms_cos_logdna.ibm_resource_instance.kms_instance: Refreshing state... [id=crn:v1:bluemix:public:kms:ca-tor:a/ID2:ID3::]
module.kms_cos_backups.ibm_resource_instance.kms_instance: Refreshing state... [id=crn:v1:bluemix:public:kms:ca-tor:a/ID2:ID4::]
module.kms_cos_logdna.ibm_kms_key.root_key: Refreshing state... [id=crn:v1:bluemix:public:kms:ca-tor:a/ID2:ID3:key:ID7]
module.kms_cos_logdna.ibm_iam_authorization_policy.cos_access_kms[0]: Refreshing state... [id=ID8]
module.kms_cos_backups.ibm_iam_authorization_policy.cos_access_kms[0]: Refreshing state... [id=ID6]
module.kms_cos_backups.ibm_kms_key.root_key: Refreshing state... [id=crn:v1:bluemix:public:kms:ca-tor:a/ID2:ID4:key:ID5]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.kms_cos_backups.ibm_kms_key.root_key has been deleted
  - resource "ibm_kms_key" "root_key" {
      - crn                     = "crn:v1:bluemix:public:kms:ca-tor:a/ID2:ID4:key:ID5" -> null
      - endpoint_type           = "public" -> null
      - force_delete            = false -> null
      - id                      = "crn:v1:bluemix:public:kms:ca-tor:a/ID2:ID4:key:ID5" -> null
      - instance_crn            = "crn:v1:bluemix:public:kms:ca-tor:a/ID2:ID4::" -> null
      - instance_id             = "ID4" -> null
      - key_id                  = "ID5" -> null
      - key_name                = "root_key" -> null
      - key_ring_id             = "default" -> null
      - resource_controller_url = "https://cloud.ibm.com/services/kms/crn%3Av1%3Abluemix%3Apublic%3Akms%3Aca-tor%3Aa%2FID2%3AID4%3A%3A" -> null
      - resource_crn            = "crn:v1:bluemix:public:kms:ca-tor:a/ID2:ID4:key:ID5" -> null
      - resource_name           = "root_key" -> null
      - resource_status         = "1" -> null
      - standard_key            = false -> null
      - type                    = "kms" -> null

      - timeouts {}
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.kms_cos_backups.ibm_kms_key.root_key will be created
  + resource "ibm_kms_key" "root_key" {
      + crn                     = (known after apply)
      + endpoint_type           = (known after apply)
      + force_delete            = false
      + id                      = (known after apply)
      + instance_crn            = (known after apply)
      + instance_id             = "ID4"
      + key_id                  = (known after apply)
      + key_name                = "root_key"
      + key_ring_id             = "default"
      + payload                 = (sensitive)
      + resource_controller_url = (known after apply)
      + resource_crn            = (known after apply)
      + resource_group_name     = (known after apply)
      + resource_name           = (known after apply)
      + resource_status         = (known after apply)
      + standard_key            = false
      + type                    = (known after apply)

      + policies {
          + dual_auth_delete {
              + created_by       = (known after apply)
              + creation_date    = (known after apply)
              + crn              = (known after apply)
              + enabled          = (known after apply)
              + id               = (known after apply)
              + last_update_date = (known after apply)
              + updated_by       = (known after apply)
            }

          + rotation {
              + created_by       = (known after apply)
              + creation_date    = (known after apply)
              + crn              = (known after apply)
              + id               = (known after apply)
              + interval_month   = (known after apply)
              + last_update_date = (known after apply)
              + updated_by       = (known after apply)
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Warnings:

- Value for undeclared variable
- Value for undeclared variable
- Values for undeclared variables
- Resource targeting is in effect

To see the full warning notes, run Terraform without -compact-warnings.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
❯ terragrunt plan -compact-warnings -target module.kms_cos_logdna  -target module.kms_cos_backups
module.kms_cos_backups.random_password.random_byok: Refreshing state... [id=none]
module.kms_cos_logdna.random_password.random_byok: Refreshing state... [id=none]
module.ibm-resource-group.ibm_resource_group.ibm_rg: Refreshing state... [id=ID1]
module.kms_cos_backups.ibm_resource_instance.kms_instance: Refreshing state... [id=crn:v1:bluemix:public:kms:ca-tor:a/ID2:ID4::]
module.kms_cos_logdna.ibm_resource_instance.kms_instance: Refreshing state... [id=crn:v1:bluemix:public:kms:ca-tor:a/ID2:ID3::]
module.kms_cos_backups.ibm_iam_authorization_policy.cos_access_kms[0]: Refreshing state... [id=ID6]
module.kms_cos_backups.ibm_kms_key.root_key: Refreshing state... [id=crn:v1:bluemix:public:kms:ca-tor:a/ID2:ID4:key:ID5]
module.kms_cos_logdna.ibm_iam_authorization_policy.cos_access_kms[0]: Refreshing state... [id=ID8]
module.kms_cos_logdna.ibm_kms_key.root_key: Refreshing state... [id=crn:v1:bluemix:public:kms:ca-tor:a/ID2:ID3:key:ID7]
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named
│ "staging_iaas_classic_username" but a value was found in file
│ "$PATH/my_personal_tokens.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named
│ "staging_iaas_classic_api_key" but a value was found in file
│ "$PATH/my_personal_tokens.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Values for undeclared variables
│
│ In addition to the other similar warnings shown, 1 other variable(s)
│ defined without being declared.
╵
╷
│ Warning: Resource targeting is in effect
│
│ You are creating a plan with the -target option, which means that the
│ result of this plan may not represent all of the changes requested by the
│ current configuration.
│
│ The -target option is not for routine use, and is provided only for
│ exceptional situations such as recovering from errors or mistakes, or when
│ Terraform specifically suggests to use it as part of an error message.
╵
╷
│ Error: Failed to read policies: kp.Error: correlation_id='26cd9b8d-f919-4cf2-9454-bc37aa5e0bdd', msg='Not Found: Key policy could not be retrieved: Please see `reasons` for more details (KEY_NOT_FOUND_ERR)', reasons='[KEY_NOT_FOUND_ERR: key does not exist - FOR_MORE_INFO_REFER: https://cloud.ibm.com/apidocs/key-protect]'
│
│   with module.kms_cos_backups.ibm_kms_key.root_key,
│   on .terraform/modules/kms_cos_backups/modules/ibm-kms/kp_root_key.tf line 1, in resource "ibm_kms_key" "root_key":
│    1: resource "ibm_kms_key" "root_key" {
│
╵
ERRO[0008] 1 error occurred:
	* exit status 1
```

</details>

With those informations, and correlating the fact that the same behavior happens with both `ibm_kms_key` and `ibm_kp_key`, this doesn't look a bug in the Terraform provider, but more like an SDK bug. Can you help in looking at the underlying code and trying to make sense of this?